[
    {
        "question": "You regularly make new friends.",
        "dimension": "E",
        "number": 1
    },
    {
        "question": "Complex and novel ideas excite you more than simple and straightforward ones.",
        "dimension": "N",
        "number": 2
    },
    {
        "question": "You usually feel more persuaded by what resonates emotionally with you than by factual arguments.",
        "dimension": "F",
        "number": 3
    },
    {
        "question": "Your living and working spaces are clean and organized.",
        "dimension": "J",
        "number": 4
    },
    {
        "question": "You usually stay calm, even under a lot of pressure.",
        "dimension": "T",
        "number": 5
    },
    {
        "question": "You find the idea of networking or promoting yourself to strangers very daunting.",
        "dimension": "I",
        "number": 6
    },
    {
        "question": "You prioritize and plan tasks effectively, often completing them well before the deadline.",
        "dimension": "J",
        "number": 7
    },
    {
        "question": "People's stories and emotions speak louder to you than numbers or data.",
        "dimension": "F",
        "number": 8
    },
    {
        "question": "You like to use organizing tools like schedules and lists.",
        "dimension": "J",
        "number": 9
    },
    {
        "question": "Even a small mistake can cause you to doubt your overall abilities and knowledge.",
        "dimension": "T",
        "number": 10
    },
    {
        "question": "You feel comfortable just walking up to someone you find interesting and striking up a conversation.",
        "dimension": "E",
        "number": 11
    },
    {
        "question": "You are not too interested in discussions about various interpretations of creative works.",
        "dimension": "S",
        "number": 12
    },
    {
        "question": "You prioritize facts over people's feelings when determining a course of action.",
        "dimension": "T",
        "number": 13
    },
    {
        "question": "You often allow the day to unfold without any schedule at all.",
        "dimension": "P",
        "number": 14
    },
    {
        "question": "You rarely worry about whether you make a good impression on people you meet.",
        "dimension": "I",
        "number": 15
    },
    {
        "question": "You enjoy participating in team-based activities.",
        "dimension": "E",
        "number": 16
    },
    {
        "question": "You enjoy experimenting with new and untested approaches.",
        "dimension": "N",
        "number": 17
    },
    {
        "question": "You prioritize being sensitive over being completely honest.",
        "dimension": "F",
        "number": 18
    },
    {
        "question": "You actively seek out new experiences and knowledge areas to explore.",
        "dimension": "N",
        "number": 19
    },
    {
        "question": "You are prone to worrying that things will take a turn for the worse.",
        "dimension": "N",
        "number": 20
    },
    {
        "question": "You enjoy solitary hobbies or activities more than group ones.",
        "dimension": "I",
        "number": 21
    },
    {
        "question": "You cannot imagine yourself writing fictional stories for a living.",
        "dimension": "S",
        "number": 22
    },
    {
        "question": "You favor efficiency in decisions, even if it means disregarding some emotional aspects.",
        "dimension": "T",
        "number": 23
    },
    {
        "question": "You prefer to do your chores before allowing yourself to relax.",
        "dimension": "J",
        "number": 24
    },
    {
        "question": "In disagreements, you prioritize proving your point over preserving the feelings of others.",
        "dimension": "T",
        "number": 25
    },
    {
        "question": "You usually wait for others to introduce themselves first at social gatherings.",
        "dimension": "I",
        "number": 26
    },
    {
        "question": "Your mood can change very quickly.",
        "dimension": "N",
        "number": 27
    },
    {
        "question": "You are not easily swayed by emotional arguments.",
        "dimension": "T",
        "number": 28
    },
    {
        "question": "You often end up doing things at the last possible moment.",
        "dimension": "P",
        "number": 29
    },
    {
        "question": "You enjoy debating ethical dilemmas.",
        "dimension": "N",
        "number": 30
    },
    {
        "question": "You usually prefer to be around others rather than on your own.",
        "dimension": "E",
        "number": 31
    },
    {
        "question": "You become bored or lose interest when the discussion gets highly theoretical.",
        "dimension": "S",
        "number": 32
    },
    {
        "question": "When facts and feelings conflict, you usually find yourself following your heart.",
        "dimension": "F",
        "number": 33
    },
    {
        "question": "You find it challenging to maintain a consistent work or study schedule.",
        "dimension": "P",
        "number": 34
    },
    {
        "question": "You rarely second-guess the choices that you have made.",
        "dimension": "J",
        "number": 35
    },
    {
        "question": "Your friends would describe you as lively and outgoing.",
        "dimension": "E",
        "number": 36
    },
    {
        "question": "You are drawn to various forms of creative expression, such as writing.",
        "dimension": "N",
        "number": 37
    },
    {
        "question": "You usually base your choices on objective facts rather than emotional impressions.",
        "dimension": "T",
        "number": 38
    },
    {
        "question": "You like to have a to-do list for each day.",
        "dimension": "J",
        "number": 39
    },
    {
        "question": "You rarely feel insecure.",
        "dimension": "T",
        "number": 40
    },
    {
        "question": "You avoid making phone calls.",
        "dimension": "I",
        "number": 41
    },
    {
        "question": "You enjoy exploring unfamiliar ideas and viewpoints.",
        "dimension": "N",
        "number": 42
    },
    {
        "question": "You can easily connect with people you have just met.",
        "dimension": "E",
        "number": 43
    },
    {
        "question": "If your plans are interrupted, your top priority is to get back on track as soon as possible.",
        "dimension": "J",
        "number": 44
    },
    {
        "question": "You are still bothered by mistakes that you made a long time ago.",
        "dimension": "F",
        "number": 45
    },
    {
        "question": "You are not too interested in discussing theories on what the world could look like in the future.",
        "dimension": "S",
        "number": 46
    },
    {
        "question": "Your emotions control you more than you control them.",
        "dimension": "F",
        "number": 47
    },
    {
        "question": "When making decisions, you focus more on how the affected people might feel than on what is most logical or efficient.",
        "dimension": "F",
        "number": 48
    },
    {
        "question": "Your personal work style is closer to spontaneous bursts of energy than organized and consistent efforts.",
        "dimension": "P",
        "number": 49
    },
    {
        "question": "When someone thinks highly of you, you wonder how long it will take them to feel disappointed in you.",
        "dimension": "I",
        "number": 50
    },
    {
        "question": "You would love a job that requires you to work alone most of the time.",
        "dimension": "I",
        "number": 51
    },
    {
        "question": "You believe that pondering abstract philosophical questions is a waste of time.",
        "dimension": "S",
        "number": 52
    },
    {
        "question": "You feel more drawn to busy, bustling atmospheres than to quiet, intimate places.",
        "dimension": "E",
        "number": 53
    },
    {
        "question": "If a decision feels right to you, you often act on it without needing further proof.",
        "dimension": "F",
        "number": 54
    },
    {
        "question": "You often feel overwhelmed.",
        "dimension": "N",
        "number": 55
    },
    {
        "question": "You complete things methodically without skipping over any steps.",
        "dimension": "J",
        "number": 56
    },
    {
        "question": "You prefer tasks that require you to come up with creative solutions rather than follow concrete steps.",
        "dimension": "N",
        "number": 57
    },
    
    {
        "question": "You are more likely to rely on emotional intuition than logical reasoning when making a choice.",
        "dimension": "F",
        "number": 58
    },
    {
        "question": "You struggle with deadlines.",
        "dimension": "P",
        "number": 59
    },
    {
        "question": "You feel confident that things will work out for you.",
        "dimension": "T",
        "number": 60
    }

    
]
